{
	"birds-toes-arrengement": {
		"title": "Arrengement of the toes in birds",
		"article": [
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "In biology, the arrangement of digits (both fingers and toes) on the hands, feet, or wings of a tetrapod animal is called \"dactyly\". It comes from the Greek "
					},
					{
						"type": "span",
						"props": {
							"className": "greek",
							"title": "dáktylos"
						},
						"text": "δακτυλος"
					},
					{
						"type": "span",
						"text": " that means \"finger\". The anamoty of bird toes is diverse, encompassing many accommodations to perform a wide variety of functions."
					}
				]
			},
			{
				"type": "p",
				"text": "Before jumping to the types of toe arrangements in birds, we have to learn how to number digits. We will assign a number (starting at 1) to each toe, but we cannot do it randomly! So we will start from the innermost digit (hallux), that would be our big toe, and give it a 1. Then we will move outwards numbering each digit consecutively until we run out of digits."
			},
			{
				"type": "p",
				"text": "The typical toe arrangements in birds are: anisodactyl, zygodactyl, heterodactyl,syndactyl, and pamprodactyl."
			},
			{
				"type": "h5",
				"text": "Anisodactyl"
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "The word \"anisodactyl\" literaly means \"unequal toes\". The prefix \"aniso-\", from the Greek "
					},
					{
						"type": "span",
						"props": {
							"className": "greek",
							"title": "ánisos"
						},
						"text": "ανισος"
					},
					{
						"type": "span",
						"text": " means \"unequal\", and we already know "
					},
					{
						"type": "span",
						"props": {
							"className": "greek",
							"title": "dáktylos"
						},
						"text": "δακτυλος"
					},
					{
						"type": "span",
						"text": " ,\"finger\". In the anisodactly arrengement the hallux (digit 1) is behind and the other three toes are in front. This toe arrengement is present in nearly all "
					},
					{
						"type": "a",
						"text": "Passeriformes",
						"props": {
							"href": "#/taxonomy/order/passeriformes"
						}
					},
					{
						"type": "span",
						"text": "."
					}
				]
			},
			{
				"type": "h5",
				"text": "Zygodactyl"
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "The word \"zygodactyl\" literaly means \"yoke-toed\". The prefix \"zygo-\", from the Greek "
					},
					{
						"type": "span",
						"props": {
							"className": "greek",
							"title": "zygós"
						},
						"text": "ζυγος"
					},
					{
						"type": "span",
						"text": " means \"yoke\", and referes to the occurrence of toes in pairs. In the zygodactyly arrengement digits 1 and 4 are directed backwards, and digits 2 and 3 are directed forwards. This toe arrengement is present in "
					},
					{
						"type": "a",
						"text": "Cuculiformes",
						"props": {
							"href": "#/taxonomy/order/cuculiformes"
						}
					},
					{
						"type": "span",
						"text": ", "
					},
					{
						"type": "a",
						"text": "Piciformes",
						"props": {
							"href": "#/taxonomy/order/piciformes"
						}
					},
					{
						"type": "span",
						"text": ", "
					},
					{
						"type": "a",
						"text": "Psittaciformes",
						"props": {
							"href": "#/taxonomy/order/psittaciformes"
						}
					},
					{
						"type": "span",
						"text": " and "
					},
					{
						"type": "a",
						"text": "Trogoniformes",
						"props": {
							"href": "#/taxonomy/order/trogoniformes"
						}
					},
					{
						"type": "span",
						"text": "."
					}
				]
			}
		]
	},
	"blue-in-nature": {
		"title": "Blue in nature",
		"article": [
			{
				"type": "p",
				"text": "You can probably think pretty fast of a green animal, or a red one, even a yellow one. But what about a blue one? There are some, of course, but it is clear that blue is the rarest color in nature."
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "Before trying to understand why is blue so rare, we first need to know what gives color to an animal. And when it comes to color there is a group of animals that displays the brightest and most colorful patterns: butterflies. Butterflies ("
					},
					{
						"type": "a",
						"text": "Papilionoidea",
						"props": {
							"href": "#/taxonomy/superfamily/papilionoidea"
						}
					},
					{
						"type": "span",
						"text": ") are a group of moths that evolved to be active during the day, and that gives them a great advantage because now they can use light to communicate. Colors are used in nature to send messages: \"I am dangerous\", \"look how pretty I am\", \"you are in my territory\", etc."
					}
				]
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "Colors in butterflies come from tiny scales that, in most cases, contain pigments, organic molecules that absorb every color but the one we see. This is true for most of the colors: yellows, reds, oranges, browns, even white and black, among others. Animals do not make take pigments out of nowhere, they get them through their diets. An easy example are flamingos ("
					},
					{
						"type": "a",
						"text": "Phoenicopteridae",
						"props": {
							"href": "#/taxonomy/family/phoenicopteridae"
						}
					},
					{
						"type": "span",
						"text": "), they are born gray but turn pink thanks to some pigments called carotenoids abundant in the crustaceous they eat. Nonetheless, that is not true for blue."
					}
				]
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "If we take a look at a blue butterfly like the "
					},
					{
						"type": "i",
						"components": [
							{
								"type": "a",
								"text": "Morpho menelaus",
								"props": {
									"href": "#/taxonomy/species/morpho-menelaus"
								}
							}
						]
					},
					{
						"type": "span",
						"text": " you can notice, as you turn around the animal, that the color changes, it does not display the same blue tone from all angles. This is because there is no blue pigment in their scales. They look blue, but they are not blue at all. If we zoom in on those scales we can see that they look like small trees. Those shapes, and more precisely their size, give that blue color. A light wave defines its color by its wavelength, and for most colors the wave reflected by the tree and the wave coming out after bouncing on the butterfly will be out of phase, which means that they cancel each other out. But this does not happen with blue. Blue has the precise right wavelength so that the reflected light waves are in sync and they make it to our eye. It is like a hall of mirrors that only lets blue light escape. There is even a pigment at the base that absorbs stray red and green light to make the blue even more pure."
					}
				]
			},
			{
				"type": "figure",
				"props": {
					"style": {
						"maxWidth": "400px"
					}
				},
				"components": [
					{
						"type": "img",
						"props": {
							"className": "article-img",
							"src": "articles/morpho-menelaus-tree-structure.png",
							"alt": "M. menelaus tree structure"
						}
					},
					{
						"type": "figcaption",
						"components": [
							{
								"type": "span",
								"text": "Figure 1.",
								"props": {
									"className": "article-figtitle"
								}
							},
							{
								"type": "span",
								"text": " Lamellae-structured ridges from a "
							},
							{
								"type": "i",
								"components": [
									{
										"type": "a",
										"text": "Morpho menelaus",
										"props": {
											"href": "#/taxonomy/species/morpho-menelaus"
										}
									}
								]
							},
							{
								"type": "span",
								"text": "."
							}
						]
					}
				]
			},
			{
				"type": "p",
				"text": "All of this happens because of the way light bends when it moves from air into another material. So what would happen if we fill all those gaps with something that is not air? The blue disappears. For example, if you throw some alcohol on the wing, the blue turns green instead. Once the alcohol evaporates, the blue comes back. This would seem to be a problem since they would lose their color each time they get wet —with rain, for example—, but their wings are water-resistant and do not let water get inside the tiny tree-like structures."
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "We now know where butterflies get their blue from. But what about other animals? The concept is always the same, but the structure varies from one species to another. Let's now take a look at a "
					},
					{
						"type": "i",
						"components": [
							{
								"type": "a",
								"text": "Cyanocitta cristata",
								"props": {
									"href": "#/taxonomy/species/cyanocitta-cristata"
								}
							}
						]
					},
					{
						"type": "span",
						"text": " feather. If we look through it the blue color disappears completely, turning brown. This is because there is no blue pigment at all. Each feather bristle contains light-scattering microscopic beads, spaced so everything but blue light is canceled out. Similar to what happened on the "
					},
					{
						"type": "i",
						"components": [
							{
								"type": "a",
								"text": "Morpho menelaus",
								"props": {
									"href": "#/taxonomy/species/morpho-menelaus"
								}
							}
						]
					},
					{
						"type": "span",
						"text": "."
					}
				]
			},
			{
				"type": "p",
				"components": [
					{
						"type": "span",
						"text": "If we take a look to other blue colors in animals, we will see that all those blues come the structure of the skin, feathers, or wherever that blue comes from. Even human blue eyes are coloreds by structures, not pigments. No vertebrate, not a single bird, or mammal, or reptile that we know, makes a blue pigment on its body. In fact, there's only one known butterfly that has cracked the code for making a true blue pigment: the "
					},
					{
						"type": "i",
						"components": [
							{
								"type": "a",
								"text": "Nessaea obrinus",
								"props": {
									"href": "#/taxonomy/species/nessaea-obrinus"
								}
							}
						]
					},
					{
						"type": "span",
						"text": "."
					}
				]
			}
		]
	},
	"monocots-vs-dicots": {
		"title": "Differences between monocots and dicots",
		"article": []
	}
}
